#1.1
"""
print('Я\n\nбудущий\n\nбекенд-разработчик!')
"""

#1.2
"""
print("Привет;мне;нравится;программирование\n\nно писать код что-то не очень.Может поможешь?")
"""

#1.3
"""
inpNumber, inpText = int(input()), input()
print(f"Это число: {inpNumber}\nЭто строка: {inpText}")
"""

#2.1
"""
a, b, c = int(input()), int(input()), int(input())
print((a ** 3 + b ** 0.5) / c)
"""

"""Шпаргалка по переводу в разные системы счисления:
a = 10  # десятичная
# перевод из разных систем счисления в десятичную
b = int('10', 2) # двоичная
c = int('17', 8) # восьмеричная
d = int('1a', 16) # шестнадцатеричная
print(a,b,c,d, end="\n")  # 10 2 15 26

# перевод из десятичной в разные
num = 37
print(bin(num))  # 0b100101
print(oct(num))  # 0o45
print(hex(num))  # 0x25
"""

